# 2) ახსენით თუ რას ეწოდება Control Flow.


# 3) ჩამოწერეთ რამდენი კომპონენტისგან შედგება Control Flow და თითოეულს მიუწერეთ განმარტება.
# sequencing- კოდის თანმიმდევრობით გაშვება
# iteration- იტერაცია
# selection-კოდში არჩევნის გაკეთება

# 4) თქვენი სიტყვებით ახსენით თუ რას ეწოდება Algorithm.
# პროგრამირების კოდების სხვადასხვა ნაირად დაწერა

# 5) მოიყვანეთ ალგორითმის 3 ნამდვილი ცხოვრების მაგალითი, 3-ც კი პროგრამირებიდან.


# 6) ჩამოწერეთ რამდენი ტიპის ალგორითმი არსებობს და თითოეულს მიუწერეთ განმარტება.
# Flowchart - კოდის სქემატურად გამოსახვა
# pseudocode - პროგრამირების ენასთან მიახლოებული კოდი
# Natural Languge - ბუნებრივი ენით დაწერილი კოდი

# 7) Control Flow და მისი შემადგენელი ნაწილები და Algorithm მისი შემადგენელი ნაწილებით 
# გამოხასეთ FlowChart-ის სახით.

# sepuencing,iteration,selection
# Flowchart,pseudocode,Natural Language

# 8) თავიდან უყურეთ ჩანაწერის იმ ნაწილს - სადაც ახალ მასალაზეა საუბარი.