# <!-- 2) მოიყვანეთ მაგალითები და ახსენით თუ რატომ არის სტრინგი - Immutable და სია - Mutable.
# ამასთანავე ახსენით ტუ რას ეწოდება Mutable და Immutable.
# Mutable - შეცვლადი
# Immutable - შეუცვლადი
# სტრინგი არის  Immutable რადგან მას ვერ გადარქმნი ვერც სტრინგად და ვერც ფლოუთად


# 3) მომხმარებელს შემოატანინეთ თავისი სახელი, გვარი, ID ნომერი და ეროვნება. ეს ყოველივე შეინახეთ User_info ცვლადში.
#  ჯერ მთლიანი სია დაბეჭდეთ, შემდეგ კი ინდექსინგის საშუალებით გამოიტანეთ სიის თითოეული ელემენტი ტერმინალში.



# 4) შექმენით Vending Machine პროგრამა.

# შექმენით Vending Machine სია სადაც მინიმუმ 10 ცალ პროდუქტს დაამატებთ. მომხმარებელი უნდა ირჩევდეს პროდუქტის ინდექსს
#  და შემდეგ თქვენ პროდუქტის დასახელება უნდა გამოუტანოთ ტერმინალში. (პირობაში დეტალები არ მიწერია, ასერომ ეცადეთ რაც
#   შეიძლება დახვეწილი და მომხმარებლისთვის მოსახერხებელი პროგრამა შექმნათ)

# 5) შექმენით Fruits სია: 
# Fruits = ["Strawberry", "Mango", "Melon", "Cherry"]
# სიის მეოთხე ელემეტი ჩაანაცვლეთ "Watermelon"-ით, მეორე ელემენტი კი "Pear"-ით. ტერმინალში დაბეჭდეთ სიის თავდაპირველი და საბოლოო სახე.

# 6) რამდენიმე ცვლადში შინახეთ სხვადასხვა სიტყვა. ამ სიტყვების გამოყენებით ააწყვეთ ერთი მთლიანი სიტყვა. მაგ.
# ("Moon", "light" -- "Moonlight") -->



User_info =["ilia","belqania","52136447","georgia"]

for i in User_info:
    print(i)



