# 2) გაიხსენეთ ყველა ის შედარების ოპერატორი , რომელიც ვისწავლეთ.
# <,>,==,!=



# 3) გააკეთეთ თითოეულ შედარების ოპერატორზე 3-3 მაგალითი.
# 5 < 10
# 10 > 5
# 5 == 5
# 5 != 4


# 4) მომხმარებელს შემოატანინეთ სიმაღლე სანტიმეტრებში. ცალკე ცვლადში კი
# შეინახეთ თქვენი სიმაღლე. დაადგინეთ მომხმარებელი არის თუ არა თქვენზე მაღალი.
height = input("enter your height: ")

my_height = "170"
if my_height == height:
    print("udris")

else:
    print("ar udris")



# 5) დეტალურად ახსენით თუ რატომ გამოიტანს მოცემული კოდი False-ს ტერმინალში:

# num1 = "14"
# num2 = 14
# print(num1 == num2)
# "რადგან ინტეჯერის და სტრინგის კონკატინაცია ვერ დამყარდება"

# 6) ცვლადში შეინახეთ თქვენი გვარი, შემდეგ კი მომხმარებელს შემოატანინეთ მისი გვარი.
# დაადგინეთ თქვენი და მომხმარებლის გვარები ემთხვევა თუ არა ერთმანეთს.

surname = "belqania"

gvari = input("enter your surname: ")

if surname == gvari:
    print("true")

else:
    print("false")

