# 2) მომხმარებელს შემოატანინეთ გვარი. გამოიყენეთ For loop-ი იმისთვის, რომ მისი გვარის თითოეული ასო ცალცალკე გამოიტანოთ ტერმინალში.

# 3) დაწერეთ წვენის გაყიდვის პროგრამა სუპერმარკეტისთვის:

# ჩათვალეთ წვენების საწყისი რაოდენობა არის 300. თითოეული მომხმარებელი მარკეტში შემოსვლისას ყიდულობს 2 წვენს. პროგრამამ უნდა გამოიტანოს
#  "You have bought the drink" და გვერდზე მარაგში დარჩენილი წვენების რაოდენობა. როდესა მარაგი ამოიწურება - ტერმინალში დაობეჭდოს
#  "Out of stock"

# 4) დაწერეთ For loop-ის პროგრამა, რომელიც 50-დან 20-მდე გამოიტანს რიცხვებს 3-3 რიცხვის გამოკლებით.

# 5) დაწერეთ While loop_ის პროგრამა, რომელიც 150-დან 0-მდე გამოიტანს ყველა რიცხვს.

# 6) თქვენი სიტყვებით დაწვრილებით ახსენით, თუ როგორ მუშაობს While loop.

# ვაილ ლუპი იქამდე ზრდის რიცხვს ან აკლებს სანამ i ტოლი არ იქნება


# 7) Level 18-ისა და Level 20-ს ჩანაწერებს აუცილებლად თავიდან უყურეთ ❗❗



# surname = "belqania"

# for i in surname:
#     print(i)





# for i in range(300,0,-2):
#     if i == 1:
#         print("Out of stock")    
#     print(i,"You have bought the drink",i)

      





# i = 1

# for i in range(50,20,-3):
#     i -= 1
#     print(i)



# i = 150
    
# while i > 0:
#     i -= 1
#     print(i)
