# 2) კომენტარის სახით დაწერეთ თუ რა დანიშნულება აქვს type() ფუნქციას და რატომაა მისი გამოყენება მოხერხებული.
# type() ფუნქცია გვეხმარება გავიგოთ თუ რა კლასს მიეკუთვნება კონკრეტულლი წინადადება სიმბოლო




# 3) ჩამოწერეთ ყველა ის ფუნქცია რომელიც “Data Conversion”-ს მოიცავს. გატესტეთ თითოეული ყველა ნასწავლ მონაცემთა ტიპზე.
# str,int,float




# 4) ცვლადებში შეინახეთ თქვენი სახელი,  გვარი და ასაკი (Integer) . ტერმინალში გამოიტანეთ წინადადება - რომელსაც კონკატინაციის შედეგად მიიღებთ.
#  ვიცით რომ String-სა და Integer-ს შორის მათემატიკურ ოპერაციას ვერ შევასრულებთ,
#  შესაბამისად დაწერეთ ისეთი კოდი, რომ Error-ების გარეშე გაეშვას ტერმინალში.
# name_and_surname = ("ilia belqania")
# age = int(13)
# print(name_and_surname + str(age))

# 5) მომხმარებელს შემოატანინეთ 5 რიცხვი. დაწერეთ პროგრამა, რომელიც გამოთვლის და დაბეჭდავს ამ რიცხვების საშუალო არითმეტიკულს. 
num = input("enter 5 number: ")
print(sum(input))
    




#  (საშუალო არითმეტიკული - რიცხვთა ჯამის განაყოფი რიცხვების რაოდენობაზე)

# 6) მომხმარებელს შემოატანინეთ ტემპერატურა ცელსიუსში. დაწერეთ პროგრამა, რომელიც მომხმარებლის მიერ შემოტანილ
#  ტემპერატურას გადაიყვანს ფარენგეიტში და დაბეჭდეთ საბოლოო შედეგი. (მოიძიეთ ფორმულა ინტერნეტში)

# 7) მეხუთე დავალების მსგავსად, შემოატანინეთ მომხმარებელს ტემპერატურა, თუმცა ამჯერად - ფარენგეიტში.
#  შემდეგ კი დაწერეთ პროგრამა, რომელიც შემოტანილ ტემპერატურას ცელსიუსში გადაიყვანს და საბოლოოდ დაბეჭდეთ შედეგი.



