# 2) მოცემულია სტრინგი: "Programming"

#     დაბეჭდეთ მხოლოდ პირველი 5 სიმბოლო.

#     • დაბეჭდეთ ბოლო 3 სიმბოლო.

#     • დაბეჭდეთ სტრინგი შებრუნებულად.
str = "Programming"
print(str[0:5])

print([str[8:11]])

print([str[::-1]])

# 3) მოცემულია სია: fruits = ['apple', 'banana', 'cherry', 'date', 'fig', 'grape']
#   ჯერ სიიდან ამოიღეთ შუა სამი ელემენტი, შემდეგ დაბეჭდეთ სიის ყოველი მეორე ელემენტი.
fruits = ['apple', 'banana', 'cherry', 'date', 'fig', 'grape']
print(fruits.pop(1))
print(fruits.pop(2))
print(fruits.pop(3))
print(fruits[::2])

# 4)  ცვლადში შეინახეთ სტრინგი, სადაც Alphabet-ის ყველა ასოს ჩაწერთ. 

#     • ამოიღეთ სტრინდიდან ყველა მესამე სიმბოლო Slicing-ის გამოყენებით.

#    • შებრუნებული სტრინგიდან ამოღეთ მხოლოდ ყოველი მეორე სიმბოლო.

Alphabet = ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y","Z"]
print(Alphabet[::3])
print(Alphabet[::-2])

# 5) მოცემულია სტრინგი: text = "IndexingAndSlicingIsPowerful"

# ამოიღეთ text ცვლადიდან სიტყვა "Slicing". შემდეგ შეაბრუნეთ და გამოიტანეთ შედეგის სახით ეკრანზე.

text = "IndexingAndSlicingIsPowerful"
print(text[12:19])
print(text)

# 6) მოცემულია სტრინგი: word = "Programming"

#    • დაბეჭდეთ სტრინგი უკუღმა ისე, რომ გამოტოვებული იყოს ყოველი მეორე ასო.

#    • ამოჭერით სტრინგი შუა სამი ასო.
word = "Programming"
print(word[::-2])
print(word[3])
print(word[4])
print(word[5])
print(word)


#    • შეაერთეთ მხოლოდ ლუწ ინდექსებზე მყოფი ასოები.
# 7) შექმენით ცვლადი alphabet = "abcdefghijklmnopqrstuvwxyz"

#  შექმენი სიტყვა "python" ამ სტრინგიდან ინდექსების კომბინაციით.

# 8) მოცემულია სია: nums = [0, 10, 20, 30, 40, 50, 60, 70]

#    • ამოჭერით სიიდან ბოლო სამი ელემენტი.

#    • ამოიღეთ ელემენტები 20-დან 50-ის ჩათვლით.
nums = [0, 10, 20, 30, 40, 50, 60, 70]
print(nums.pop(5))
print(nums.pop(5))
print(nums.pop(5))
print(nums[2:7])


# 9) Level 29-ზე დაწყებული Html პროექტისთვის შეადგინეთ (მხოლოდ) Products
#  სექციის კოდი, ჩემი მინიშნების გარეშე მოიფიქრეთ, თუ რა კომპონენტები უნდა 
# დაამატოთ წიგნების გასაყიდ გვერდს. თქვენს მიერ აწყობილი გვერდი გასტილეთ 
# CSS-ის გამოყენებით ცისფერ/ლურჯ თემაში, ფერების ასარჩევად გადადით რესურსებში 
# ჩაგდებული საიტის ლინკზე. რომლის გვერდიც ყველაზე მეტად მომეწონება, იმაზე 
# დაყრდნობით ავაგებ ჩვენი წიგნების საიტისთვის სტილსა და სტრუქტურას შემდეგ Html-ს გაკვეთილზე.



