# 2) მომხმარებელს შემოატანინეთ გვარი. გამოიყენეთ For loop-ი იმისთვის, რომ მისი გვარის თითოეული ასო ცალცალკე გამოიტანოთ ტერმინალში.

# 3) დაწერეთ წვენის გაყიდვის პროგრამა სუპერმარკეტისთვის:

# ჩათვალეთ წვენების საწყისი რაოდენობა არის 300. თითოეული მომხმარებელი მარკეტში შემოსვლისას ყიდულობს 2 წვენს.
# პროგრამამ უნდა გამოიტანოს "You have bought the drink" და გვერდზე მარაგში დარჩენილი წვენების რაოდენობა.
# როდესა მარაგი ამოიწურება - ტერმინალში დაობეჭდოს "Out of stock"

# 4) დაწერეთ For loop-ის პროგრამა, რომელიც 50-დან 20-მდე გამოიტანს რიცხვებს 3-3 რიცხვის გამოკლებით.

# 5) დაწერეთ While loop_ის პროგრამა, რომელიც 150-დან 0-მდე გამოიტანს ყველა რიცხვს.
# 6) თქვენი სიტყვებით დაწვრილებით ახსენით, თუ როგორ მუშაობს While loop.



# name = "ilia"

# for i in name:
#     print(i)


for i in range(50,20):
    print(-i)
