# 2) მოიყვანეთ მაგალითები და ახსენით თუ რატომ არის სტრინგი - Immutable და სია - Mutable.
# ამასთანავე ახსენით ტუ რას ეწოდება Mutable და Immutable.
# Immutable - შეუცვლადი სტრინგი არის შეუცვლელი რადგან მას ვერ გადარქმნი ვერც რიცხვად და ვერც წილადად
# Mutable - შეცვლადი სია არის შეცვლადი რადგან შეგვიძლია ამოვიღოთ სტრინგი და ჩავანაცვლოთ სხვა რამით

# 3) მომხმარებელს შემოატანინეთ თავისი სახელი, გვარი, ID ნომერი და ეროვნება. ეს ყოველივე შეინახეთ User_info ცვლადში. ჯერ მთლიანი სია დაბეჭდეთ,
# შემდეგ კი ინდექსინგის საშუალებით გამოიტანეთ სიის თითოეული ელემენტი ტერმინალში.
User_info = ["ilia","belqania","12345678","georgia"]
for i in User_info:
    print(i)

print(User_info[0])
print(User_info[1])
print(User_info[2])
print(User_info[3])
# 4) შექმენით Vending Machine პროგრამა.

# შექმენით Vending Machine სია სადაც მინიმუმ 10 ცალ პროდუქტს დაამატებთ. მომხმარებელი უნდა ირჩევდეს პროდუქტის ინდექსს და შემდეგ თქვენ 
# პროდუქტის დასახელება უნდა გამოუტანოთ ტერმინალში. (პირობაში დეტალები არ მიწერია, ასერომ ეცადეთ რაც შეიძლება დახვეწილი და მომხმარებლისთვის
#                                                    მოსახერხებელი პროგრამა შექმნათ)

# 5) შექმენით Fruits სია: 
# Fruits = ["Strawberry", "Mango", "Melon", "Cherry"]
# სიის მეოთხე ელემეტი ჩაანაცვლეთ "Watermelon"-ით, მეორე ელემენტი კი "Pear"-ით. ტერმინალში დაბეჭდეთ სიის თავდაპირველი და საბოლოო სახე.
Fruits = ["Strawberry", "Mango", "Melon", "Cherry"]
print(Fruits)
Fruits.pop(3)
Fruits.append("Watermelon")
Fruits.pop(1)
Fruits.insert(1,"pear")
print(Fruits)



# 6) რამდენიმე ცვლადში შინახეთ სხვადასხვა სიტყვა. ამ სიტყვების გამოყენებით ააწყვეთ ერთი მთლიანი სიტყვა. მაგ.
# ("Moon", "light" -- "Moonlight")

num1 = "hello"
num2 = "world"
print(num1 + num2)