# 4) დაწერეთ ფუნქცია სახელწოდებით odd_or_even. ფუნქციამ უნდა დააბრუნოს Even თუ არგუმენტად გადაცემული რიცხვი ლუწია, ხოლოდ Odd - თუ კენტი.

# def odd_or_even(a):
#     if a%2 == 0:
#         print("even")
#     else:
#         print("odd")
# odd_or_even(8)


# 3) შექმენით ფუნქცია print_names, რომელიც მიიღებს სახელების სიას და ტერმინალში თითოეული მათგანს ცალ-ცალკე ხაზზე დაბეჭდავს.

# def print_names(a): 
#     for i in a:
#         print(i)
# print_names(["ilia","nika","giorgi"])

# 4) შექმენით Fruits სია 4 ელემენტით.
# მომხმარებელს შემოატანინეთ ახალი ხილი და ჩასვით ის სიის მეორე ინდექსზე.
# საბოლოოდ ტერმინალში გამოიტანეთ განახლებული სია.


# def Fruits(a):
#     a.insert(2,"მარწყვი")
#     print(a)

# Fruits(["ვაშლი","მსხალი","ატამი","ყურძენი"])


# შექმენით ფუნქცია სახელწოდებით sum, რომელსაც არგუმენტად გადაეცემა 3 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ სამი რიცხვის ჯამი დააბრუნოს.
# def sum(a,b,c):
#     print(a+b+c)
# sum(5,4,10)


# შექმენით ფუნქცია და გადაეცით არგუმენტად სია. ფუნქციამ უნდა დააბრუნოს ახალი სია, რომლის თითოეული ელემენტიც უნდა იყოს კვადრატში აყვანილი.

# def list(a):
#     arry=[]
#     for num in a:
#         arry.append(num**4)
#     print(arry)


# list([1,2,3,4,5])

# def list(a):
#     for i in range(len(a)):
#         if a[i] % 2 ==0:
#             print(a[i],"even")
#         else:
#             print(a[i],"odd")

# list([1,2,3,4,5,6,7,8,9,10])